OpenFOAM-v1812/modules/OpenQBMM/tutorials/mixingTransportFoam/twoStreamsQMOM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0)
    (0.075 0 0)
    (0.15 0 0)
    (0.15 1 0)
    (0.075 1 0)
    (0 1 0)
    (0 0 0.005)
    (0.075 0 0.005)
    (0.15 0 0.005)
    (0.15 1 0.005)
    (0.075 1 0.005)
    (0 1 0.005)
);

blocks
(
    hex (0 1 4 5 6 7 10 11) (15 100 1) simpleGrading (1 1 1)
    hex (1 2 3 4 7 8 9 10) (15 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet1
    {
        type patch;
        faces
        (
            (1 7 6 0)
        );
    }
    inlet2
    {
        type patch;
        faces
        (
            (2 8 7 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (11 10 4 5)
            (10  9 3 4)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 6 11 5)
            (3 9  8 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (6 7 10 11)
            (7 8 9 10)
            (5 4 1 0)
            (4 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
